{
  "format": "graph-model",
  "userDefinedMetadata": {
    "signature": {
      "inputs": {
        "images:0": {
          "dtype": "DT_FLOAT",
          "name": "images:0",
          "tensorShape": {
            "dim": [
              { "size": "-1" },
              { "size": "224" },
              { "size": "224" },
              { "size": "3" }
            ]
          }
        }
      },
      "outputs": {
        "module_apply_default/MobilenetV2/Logits/output:0": {
          "dtype": "DT_FLOAT",
          "name": "module_apply_default/MobilenetV2/Logits/output:0",
          "tensorShape": { "dim": [{ "size": "-1" }, { "size": "1001" }] }
        }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "1280" },
                  { "size": "1001" }
                ]
              }
            }
          }
        },
        "name": "module/MobilenetV2/Logits/Conv2d_1c_1x1/weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1001" }] }
            }
          }
        },
        "name": "module/MobilenetV2/Logits/Conv2d_1c_1x1/biases",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "224" },
                { "size": "224" },
                { "size": "3" }
              ]
            }
          }
        },
        "name": "images",
        "op": "Placeholder"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        },
        "name": "module_apply_default/hub_input/Mul/y",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        },
        "name": "module_apply_default/hub_input/Sub/y",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/Conv/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "160" },
                  { "size": "960" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_14/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/Conv/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "320" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_16/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "16" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "960" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_14/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "16" },
                  { "size": "96" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "96" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "96" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "96" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "96" },
                  { "size": "24" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_1/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "960" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_14/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "24" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_1/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "24" },
                  { "size": "144" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_2/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "144" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_2/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "960" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_14/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "144" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "144" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "144" },
                  { "size": "24" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_2/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "24" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_2/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "24" },
                  { "size": "144" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_3/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "144" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_3/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "960" },
                  { "size": "160" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_14/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "144" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "144" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "144" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_3/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "320" },
                  { "size": "1280" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/Conv_1/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_3/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "192" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_4/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "160" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_14/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_4/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "192" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_4/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_4/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "192" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_5/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "160" },
                  { "size": "960" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_15/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_5/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "192" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_5/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_5/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_5/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "960" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_15/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_5/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "192" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_6/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1280" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/Conv_1/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_6/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "192" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_6/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_6/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "64" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_6/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "960" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_15/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_6/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "384" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_7/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_7/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "960" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_15/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "384" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_7/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_7/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "64" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_7/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_7/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "384" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_8/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_8/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "960" },
                  { "size": "160" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_15/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "384" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_8/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_8/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "64" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_8/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_8/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "384" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_9/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "160" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_15/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_9/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "384" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_9/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_9/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "64" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_9/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_9/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "384" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_10/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "160" },
                  { "size": "960" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_16/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_10/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "384" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_10/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_10/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "96" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_10/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "960" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_16/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "96" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_10/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "96" },
                  { "size": "576" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_11/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_11/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "576" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_11/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_11/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "576" },
                  { "size": "96" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_11/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "960" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_16/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "96" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_11/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "96" },
                  { "size": "576" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_12/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_12/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "960" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_16/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "576" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_12/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_12/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "576" },
                  { "size": "96" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_12/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "96" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_12/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "96" },
                  { "size": "576" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_13/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_13/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "960" },
                  { "size": "320" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_16/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "576" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_13/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_13/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "576" },
                  { "size": "160" }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_13/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "160" }] }
            }
          }
        },
        "name": "module_apply_default/MobilenetV2/expanded_conv_13/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "input": ["images", "module_apply_default/hub_input/Mul/y"],
        "attr": { "T": { "type": "DT_FLOAT" } },
